#### IFCLegacyStairOrRamp Members

---

|  |
| --- |
| IFCLegacyStairOrRamp Class   Methods   Properties   See Also |

The  IFCLegacyStairOrRamp  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  IFCLegacyStairOrRamp |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundaryLines | Gets boundary lines. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLandingGeometries | Gets the geometries of landings. |
| Public method | GetNumberOfRisers | Gets the number of risers. |
| Public method | GetNumberOfTreads | Gets the number of treads. |
| Public method | GetRunGeometries | Gets the geometries of runs. |
| Public method | GetStringerGeometries | Gets the geometries of stringers. |
| Public method | GetTreadsLength | Gets the length of treads. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetWalkLines | Gets walk lines. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsRamp | True if it is a ramp, false if it is a stair. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | RiserHeight | The height of riser. |

# See Also

IFCLegacyStairOrRamp Class

Autodesk.Revit.DB.IFC Namespace